app/controllers/composer_controller.rb

  def show
    @composer = Composer.find(params[:id])
---
SELECT * FROM `composers` WHERE (`composers`.`id` = 2) LIMIT 1