app/controllers/edition_controller.rb

  def show
    @edition = Edition.find(params[:id])
---
SELECT * FROM `editions` WHERE (`editions`.`id` = 1)