app/controllers/work_controller.rb

  def show
    @work = Work.find(params[:id])
---
SELECT * FROM `works` WHERE (`works`.`id` = 1)